; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v2 ?v13)
             (pred_8 ?v9 ?v4)
             (pred_7 ?v2 ?v4)
             (pred_12 ?v6 ?v2 )
	     (pred_10 ?v2)
             (pred_4 ?v10)
             (pred_5 ?v9)
             (pred_3 ?v4)
             (pred_2 ?v2)
             (pred_11 ?v9)
             (pred_1 ?v2)
             (pred_9 ))



(:action op_4
:parameters (?v12 ?v8 ?v5 ?v7)
:precondition (and (pred_4 ?v12) (pred_4 ?v8) (pred_5 ?v5) (pred_3 ?v7)
          (pred_6 ?v12 ?v8) (pred_8 ?v5 ?v7)
                   (pred_7 ?v8 ?v7) (pred_10 ?v12) 
                   (pred_2 ?v8) (pred_11 ?v5))
:effect (and  (pred_1 ?v8) (not (pred_2 ?v8))))


(:action op_3
:parameters (?v12 ?v1)
:precondition (and (pred_4 ?v12) (pred_4 ?v1)
               (pred_10 ?v12) (pred_6 ?v12 ?v1) (pred_1 ?v1))
:effect (and (pred_10 ?v1) (not (pred_10 ?v12))))

(:action op_5
:parameters (?v12 ?v5)
:precondition (and (pred_4 ?v12) (pred_5 ?v5) 
                  (pred_10 ?v12) (pred_12 ?v5 ?v12) (pred_9 ))
:effect (and (pred_11 ?v5)
   (not (pred_12 ?v5 ?v12)) (not (pred_9 ))))


(:action op_1
:parameters (?v12 ?v3 ?v11)
:precondition (and (pred_4 ?v12) (pred_5 ?v3) (pred_5 ?v11)
                  (pred_10 ?v12) (pred_11 ?v11) (pred_12 ?v3 ?v12))
:effect (and (pred_11 ?v3) (pred_12 ?v11 ?v12)
        (not (pred_11 ?v11)) (not (pred_12 ?v3 ?v12))))

(:action op_2
:parameters (?v12 ?v5)
:precondition (and (pred_4 ?v12) (pred_5 ?v5) 
                  (pred_10 ?v12) (pred_11 ?v5))
:effect (and (pred_9 ) (pred_12 ?v5 ?v12) (not (pred_11 ?v5)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_04 obj_13 obj_07 obj_02 obj_11 obj_08 obj_12 obj_01
    obj_05 obj_06
    obj_09 obj_10
    )

    (:init
       (pred_9)

       (pred_4 obj_03)
       (pred_4 obj_04)
       (pred_4 obj_13)
       (pred_4 obj_07)
       (pred_4 obj_02)
       (pred_4 obj_11)
       (pred_4 obj_08)
       (pred_4 obj_12)
       (pred_4 obj_01)
       (pred_3 obj_05)
       (pred_3 obj_06)
       (pred_5 obj_09)
       (pred_5 obj_10)

       (pred_6 obj_03 obj_07)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_04 obj_02)
       (pred_6 obj_04 obj_13)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_13 obj_04)
       (pred_6 obj_07 obj_08)
       (pred_6 obj_07 obj_02)
       (pred_6 obj_07 obj_03)
       (pred_6 obj_02 obj_12)
       (pred_6 obj_02 obj_11)
       (pred_6 obj_02 obj_04)
       (pred_6 obj_02 obj_07)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_02)
       (pred_6 obj_08 obj_12)
       (pred_6 obj_08 obj_07)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_12 obj_02)
       (pred_6 obj_12 obj_08)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_01 obj_12)
       (pred_2 obj_01)
       (pred_2 obj_08)
       (pred_7  obj_01 obj_05)
       (pred_7  obj_08 obj_06)
       (pred_1 obj_03)
       (pred_1 obj_04)
       (pred_1 obj_13)
       (pred_1 obj_07)
       (pred_1 obj_02)
       (pred_1 obj_11)
       (pred_1 obj_12)

       (pred_8  obj_09 obj_05)
       (pred_8  obj_10 obj_06)
       (pred_12 obj_09 obj_07)
       (pred_12 obj_10 obj_04)
       (pred_10 obj_11)
    )

    (:goal (and
       (pred_12 obj_10 obj_03)
    ))
(:constraints
  (always (not (pred_10 obj_13)))
)
)

; plan
1. (op_3 obj_11 obj_02)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_02)
   goals met: 0 of 1
2. (op_3 obj_02 obj_04)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_04)
   goals met: 0 of 1
3. (op_5 obj_04 obj_10)
   deleted: (pred_12 obj_10 obj_04) (pred_9)
   added: (pred_11 obj_10)
   goals met: 0 of 1
4. (op_3 obj_04 obj_03)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_03)
   goals met: 0 of 1
5. (op_2 obj_03 obj_10)
   deleted: (pred_11 obj_10)
   added: (pred_9) (pred_12 obj_10 obj_03)
   goals met: 1 of 1
